#ifndef CONFIG_H
#define CONFIG_H

// ------------------------------
// 📌 กำหนดค่าตัวแปรคงที่ (Constant Variables)
// ------------------------------
#define TOPIC_PUB_1 "Test/sent/demo"
#define MC_NO "OAT"

// ------------------------------
// 📌 ตารางเก็บค่า (Data Table)
// ------------------------------
const String def_tb[][5] = {
    // name      address  type  value  prv_value
    { "Alarm_1", "11", "2", "", "" },
    { "Alarm_2", "12", "2", "", "" },
    { "Alarm_3", "13", "2", "", "" },
    { "Alarm_4", "14", "2", "", "" },
    { "Alarm_5", "15", "2", "", "" },
    { "Data_1", "21", "3", "", "" },
    { "Data_2", "22", "3", "", "" },
    { "Data_3", "23", "3", "", "" },
    { "Data_4", "24", "3", "", "" },
    { "Data_5", "25", "3", "", "" },
    { "RUN", "1", "1", "", "" },
    { "STOP", "2", "1", "", "" },
    { "Alarm", "3", "1", "", "" }
};

#endif  // CONFIG_H
